Revit 2026 API

# PickedBox Properties

---

The PickedBox type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Max | Maximum coordinates (upper-right-front corner of the pick box). |
|  | Min | Minimum coordinates (lower-left-rear corner of the pick box). |

#### Reference

PickedBox Class

Autodesk.Revit.UI.Selection Namespace